# WireTypes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..WireTypes Property
ElectricalSetting Class See Also
---
Get all wire type definition information of the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireTypeSet WireTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WireTypes As WireTypeSet
	Get
```

Visual C++
---
```text
public:
property WireTypeSet^ WireTypes {
	WireTypeSet^ get ();
}
```

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace